[LANG]
language=Czech (Česko)
[FONT]
font-name=Segoe UI
welcome-text-size=62
home-text-size=22
home-section-size=24
analysis-text-size=20
analysis-section-size=22
left-panel-size=14
panel-list-size=16
panel-list-label-size=20
panel-list-header-size=16
panel-list-item-size=13
panel-button-size=12
combobox-size=16
list-combobox-size=16
checkbox-size=16
radio-size=15
elem-size=12
image-button-size=14
form-text-size=15
list-text-size=16
search-edit-size=16
message-text-size=16
setting-button-size=12
process-text-size=14
properites-title-font=18
properites-section-font=16
log-list-item-text-size=12
log-list-item-sql-size=14
[ERROR]
000000=
200001=Chyba syntaxe SQL
200002=Soubor neexistuje
200003=Soubor je poškozen
200004=Chyba parametru
200026=Název tabulky již existuje
200027=Název tabulky neexistuje
200028=Chyba importu CSV souboru, nepodařilo se vygenerovat SQL, zkontrolujte obsah CSV souboru a konfiguraci
300001=Není vybrán sloupec tabulky pro vytvoření indexu
300002=SQL příkaz nemůže být prázdný
300003=Analýza SQL podporuje pouze SELECT dotazy
[STRING]
home=Domů
database=Databáze
analysis=Analýza
view=Pohled
setting=Nastavení
items=záznamů
tables=Tabulky
views=Pohledy
triggers=Triggery
columns=Sloupce
indexes=Indexy
table=Tabulka
clear-all=Vymazat vše
yes=Ano
no=Ne
welcome-text=Vítejte v CuteSqlite
home-text1=CuteSqlite je grafický klientský nástroj (GUI) pro Sqlite3.
home-text2=Umožňuje navrhovat, vytvářet a procházet databáze, spravovat databázové objekty,
home-text3=vkládat data a také navrhovat a spouštět SQL dotazy pro zpracování uložených dat.
home-text4=Můžete také migrovat databázi a data od jiných dodavatelů databází do databáze Sqlite.
db-section-text=Databáze Sqlite
analysis-text1=CuteSqlite umožňuje analyzovat a optimalizovat výkon SQL příkazů.
analysis-text2=A také umožňuje analyzovat kapacitu úložiště každé tabulky v databázi,
analysis-text3=stejně jako konfigurovat parametry databáze pro její optimalizaci.
perf-analysis-section-text=Analýza výkonu
error-text=Systémová chyba:
create-database=Vytvořit novou databázi (Ctrl+N)
open-database=Otevřít databázi (Ctrl+O)
refresh-database=Obnovit databázi (F5)
delete-database=Odstranit vybranou databázi ze seznamu (Del)
override-user-db=Data smazaného souboru nelze obnovit. Potvrdit přepsání databáze?
create-db-success-text=Databáze úspěšně vytvořena
open-db-exists-inlist=Databáze je již otevřena, neopakujte operaci
open-db-success-text=Databáze úspěšně otevřena
delete-user-db=Potvrdit odstranění databáze "{dbName}" ze seznamu?
delete-db-success-text=Databáze úspěšně odstraněna ze seznamu
query-editor=Editor dotazů
history=Historie
history-tip=Historie (F8)
result-list=Výsledky
result-info=Informace
result-table-data=Data tabulky
table-properties=Vlastnosti tabulky
exec-select-sql=Spustit vybraný dotaz (F9)
exec-all-sql=Spustit všechny dotazy (F10)
explain-select-sql=Vysvětlit (Explain) vybraný SQL příkaz (F11)
explain-query-plan-sql=Vysvětlit plán dotazu (Explain query plan) vybraného SQL příkazu (F12)
query-page-help=Funkce automatického dokončování: [Tab] -> další karta; [Ctrl+Mezerník] -> zobrazit shody; [Ctrl+Enter] -> zobrazit všechny značky
no-select-userdb=Není vybrána žádná databáze
no-sql-statement=Editor dotazů neobsahuje žádný SQL příkaz
no-sql-content=Editor dotazů neobsahuje žádný SQL obsah
show-form-view=Zobrazit formulářové zobrazení
export-result-as=Exportovat jako... (Ctrl+Alt+E)
copy-result-data=Kopírovat data do schránky
clear-all=Vymazat vše
ok=OK
cancel=Zrušit
export-text-description=Vyberte formát pro export dat
csv-settings=Možnosti CSV
csv-field-settings=Sloupce
csv-line-settings=Řádky
csv-charset-settings=Znaková sada
excel-settings=Možnosti Excelu
sql-settings=Možnosti SQL
export-fields-settings=Vyberte sloupce k exportu
terminated-by=Oddělovač
enclosed-by=Ohraničovač
escaped-by=Escapovací znak
field-terminated-by=Oddělovač sloupců
field-enclosed-by=Ohraničovač sloupců
field-escaped-by=Escapovací znak sloupců
line-terminated-by=Oddělovač řádků
add-column-name=Přidat názvy sloupců do záhlaví
csv-charset=Znaková sada
excel-column-max-size=Omezení velikosti textového sloupce
excel-decinmal-places=Desetinná místa
structure-only=Pouze struktura
data-only=Pouze data
structure-and-data=Struktura a data
select-all=Vybrat vše
deselect-all=Odznačit vše
save-to-file=Uložit do souboru
expert-fmt-error=Prosím, vyberte formát souboru pro export dat
terminated-by-error=Prosím, zadejte hodnotu pro "Oddělovač"
enclosed-by-error=Prosím, zadejte hodnotu pro "Ohraničovač"
escaped-by-error=Prosím, zadejte hodnotu pro "Escapovací znak"
line-terminated-by-error=Hodnota "Oddělovač řádků" je nesprávná
excel-column-max-size-error=Prosím, zadejte hodnotu pro "Omezení velikosti textového sloupce"
excel-decinmal-places-error=Prosím, zadejte hodnotu pro "Desetinná místa"
export-sql-error=Prosím, vyberte možnosti SQL
selected-fields-error=Prosím, vyberte sloupce k exportu
export-path-error=Prosím, zadejte cestu k exportnímu souboru
sql-notsupport-multitable-query-error=Export výsledků z dotazů přes více tabulek a poddotazů není podporován
export-success-text=Export úspěšný, bylo exportováno {rows} řádků dat. Otevřít soubor?
open-the-file=Otevřít soubor
export-file-exists-prompt={export-path} již existuje. Nahradit?
limit-rows=Omezení řádků
offset=Počáteční řádek
rows=Počet řádků
copy-all-rows-to-clipboard=Kopírovat všechny řádky do schránky Ctrl+Alt+A
copy-sel-rows-to-clipboard=Kopírovat vybrané řádky do schránky Ctrl+Alt+H
copy-all-rows-as-sql=Kopírovat všechny řádky jako SQL Ctrl+Alt+J
copy-sel-rows-as-sql=Kopírovat vybrané řádky jako SQL Ctrl+Alt+K
read-only=Pouze pro čtení
filter=Filr (Ctrl+Alt+F)
filter-in-use=Filr se používá
refresh=Obnovit (Ctrl+F5)
refresh-page=Obnovit
new-row-tip=Nový řádek (Ctrl+Alt+N)
copy-row-tip=Kopírovat řádek (Ctrl+Alt+C)
save-tip=Uložit (Ctrl+Alt+S)
delete-tip=Smazat vybraný řádek (Ctrl+Del)
cancel-tip=Zpět změny (Ctrl+Alt+Z)
revert-tip=Obnovit
save=Uložit
revert=Zpět změny
column=Název sloupce
condition=Podmínka
value=Hodnota
delete-confirm-text=Potvrdit smazání vybraných řádků?
query=Dotaz
result=Výsledek
affected-rows=Ovlivněné řádky
exec-time=Čas provedení
transfer-time=Čas přenosu
total-time=Celkový čas
database-create=Vytvořit DB Ctrl+N
database-open=Otevřít DB Ctrl+O
database-refresh=Obnovit DB Ctrl+R
database-delete=Smazat DB Del
database-copy=Kopírovat DB jako... Ctrl+P
database-export-as-sql=Exportovat DB do SQL Ctrl+E
database-import-from-sql=Importovat SQL do DB Ctrl+I
database-new=Vytvořit
database-new-table=Tabulku
database-new-view=Pohled
database-new-trigger=Trigger
export-as-sql-text-description=Exportovat vybrané tabulky/pohledy/triggery DB jako SQL
select-database=Vybraná databáze
database-objects=Objekty
structure-and-data-settings=Nastavení struktury a dat
insert-statement-settings=Nastavení příkazu INSERT
tbl-statement-settings=Nastavení příkazů tabulky
retain-column-text=Zachovat názvy sloupců v "Insert Into"
contain-multi-rows-text=Každý příkaz "Insert" obsahuje více řádků (VALUES)
retain-table-text=Zachovat starou tabulku (Create Table If Not Exists ...)
override-table-text=Přepsat starou tabulku (DROP TABLE, poté CREATE TABLE)
import-from-sql-text-description=Dávkové provedení příkazů v SQL souboru.
abort-on-error-text=Zastavit při chybě.
import-file-not-exists=Importovaný SQL soubor neexistuje, vyberte znovu.
import-path-empty-error=Cesta k importnímu souboru nemůže být prázdná.
import=Importovat
export=Exportovat
tbl-name=Název tabulky
new-table=Vytvořit tabulku
new-view=Vytvořit pohled
new-trigger=Vytvořit trigger
database=Databáze
schema=Schéma
table-columns=Sloupce
table-indexes=Indexy
table-foreignkeys=Cizí klíče
column-name=Název sloupce
data-type=Datový typ
default=Výchozí
check=Kontrola
index-name=Název indexu
index-type=Typ indexu
index-unique=Unikátní
partial-clause=Částečná klauzule
comments=Komentáře
to-be-selected=Dostupné sloupce
selected=Vybrané
up=▲
down=▼
no-columns-selected=Není vybrán žádný sloupec, prosím vyberte
sql-preview=Náhled SQL
tbl-name-empty=Název tabulky nemůže být prázdný
tbl-name-duplicated=Název tabulky již existuje
create-table-success-text=Tabulka úspěšně vytvořena.
alter-table-success-text=Tabulka úspěšně změněna.
rename-table-success-text=Název tabulky úspěšně změněn.
delete-column-confirm-text=Vybraný sloupec je referencován jedním nebo více indexy. Smazání tohoto sloupce také změní odpovídající indexy. Potvrdit smazání?
delete-index-confirm-text=Vybraný index je referencován jedním nebo více sloupci. Smazání tohoto indexu také změní odpovídající sloupce. Potvrdit smazání?
delete-confirm-text=Potvrdit smazání?
new-view=Vytvořit pohled
new-trigger=Vytvořit trigger
create-a-view-name=Název nového pohledu
view-name-not-empty=Název nového pohledu nemůže být prázdný
view-name-duplicated=Název pohledu již existuje
create-a-trigger-name=Název triggeru
trigger-name-not-empty=Název triggeru nemůže být prázdný
trigger-name-duplicated=Název triggeru již existuje
execute-sql-success=SQL úspěšně provedeno
copy-db-success-text=Databáze úspěšně zkopírována
table-open=Otevřít data tabulky Alt+O
table-create=Vytvořit tabulku Alt+N
table-alter=Změnit tabulku Alt+A
table-rename=Přejmenovat tabulku Alt+M
table-truncate=Vyprázdnit tabulku Alt+T
table-drop=Smazat tabulku Alt+Del
table-copy-as=Kopírovat tabulku do... Alt+P
table-sharding-as=Sharding Alt+G
table-export=Exportovat tabulku do... Alt+E
table-import-sql=Importovat z SQL souboru Alt+I
table-import-csv=Importovat z CSV souboru Alt+J
table-manage-index=Spravovat indexy tabulky
table-manage-foreign-key=Spravovat cizí klíče tabulky
properties=Vlastnosti
primary-key-duplicated=Primární klíč je definován vícekrát.
foreignkey-name=Název cizího klíče
referencing-columns=Sloupce této tabulky
referenced-table=Referencovaná tabulka
referenced-columns=Referencované sloupce
on-update=Při aktualizaci
on-delete=Při smazání
insert-new-column=Přidat nový sloupec
insert-new-index=Přidat nový index
insert-new-foreignkey=Přidat nový cizí klíč
insert-del-column=Smazat vybraný sloupec
insert-del-index=Smazat vybraný index
insert-del-foreignkey=Smazat vybraný cizí klíč
select-referenced-table-first=Nejprve vyberte referencovanou tabulku
new-table-name=Nový název tabulky
table-name-not-empty=Nový název tabulky nemůže být prázdný
table-name-duplicated=Nový název tabulky již existuje
ai-column-exists=Sloupec AUTOINCREMENT již existuje.
ai-fobidden-multi-pk=Již existuje sloupec AUTOINCREMENT, více sloupců primárního klíče není povoleno.
ai-column-must-integer=Sloupec AUTOINCREMENT musí být typu INTEGER.
truncate-table-confirm-text=Po vyprázdnění tabulky nelze data obnovit. Potvrdit vyprázdnění?
truncate-table-success-text=Data tabulky úspěšně vyprázdněna
drop-table-confirm-text=Po smazání tabulky nelze data obnovit. Potvrdit smazání?
drop-table-success-text=Tabulka úspěšně smazána
copy-table-text-description=Konfigurace parametrů kopírování, podporuje sharding tabulek
from-db-name=Zdrojová DB
from-tbl-name=Zdrojová tabulka
to-db-name=Cílová DB
to-tbl-name=Cílová tabulka
table-sharding-setttings=Sharding tabulky
enable-table-sharding=Povolit sharding tabulky
table-suffix-begin={suffix} Počáteční celé číslo
table-suffix-end={suffix} Koncové celé číslo
advanced-settings=Pokročilé možnosti shardingu
enable-copy-data-with-strategy=Povolit strategii kopírování dat do shardovaných tabulek
sharding-strategy-express-text=Výraz strategie shardingu: {n}
preview-sql=Náhled SQL příkazu
structure-and-data-settings-unknown=Nastavení struktury a dat nebylo vybráno
table-suffix-error=Neplatné celé číslo pro sharding, zadejte správnou hodnotu
target-table-name-no-n=Cílová tabulka musí obsahovat řetězec "{n}".
sharding-strategy-express-empty=Výraz strategie shardingu nemůže být prázdný
copy-table-success-text=Tabulka úspěšně zkopírována.
start=Zahájit
complete=Dokončeno
express-title=Výraz strategie shardingu tabulky
functions=Funkce
express-editor-help=Výraz - poklepejte na funkci nebo pole pro vložení do editoru
import-from-csv-text-description=Konfigurace pro import dat z CSV souboru
source-csv-file=Cesta ke zdrojovému CSV souboru
target-database=Cílová databáze
target-table=Cílová tabulka
columns-setttings=Sloupce
csv-data=CSV data
column-name-on-top=První řádek jako názvy sloupců
line-terminated-by=Oddělovač řádků
csv-null-as-keyword=null/NULL jako klíčové slovo SQL
encoding=Znaková sada
import-success-text=Import úspěšný
incorrect-sql-statement=Nesprávný SQL příkaz
import-error-text=Chyba importu
table-manage-columns=Spravovat sloupce
table-drop-column=Smazat sloupec
table-manage-indexes=Spravovat indexy
table-drop-index=Smazat index
create-view=Vytvořit nový pohled
open-view=Otevřít pohled
drop-view=Smazat pohled
create-trigger=Vytvořit trigger
open-trigger=Otevřít trigger
drop-trigger=Smazat trigger
drop-view-confirm-text=Po smazání pohledu jej nelze obnovit. Potvrdit smazání?
drop-view-success-text=Pohled úspěšně smazán
drop-trigger-confirm-text=Po smazání triggeru jej nelze obnovit. Potvrdit smazání?
drop-trigger-success-text=Trigger úspěšně smazán
sql-templates=Šablony SQL příkazů
pragma-templates=Pragmas
sql-log=Historie SQL
clear-all=Vymazat vše
use=Použít
explain=Vysvětlit
top=Připnout
untop=Odpojit
copy=Kopírovat
delete=Smazat
today=Dnes
yestoday=Včera
delete-sql-log-confirm-text=Opravdu chcete smazat historii SQL?
copy-to-clipboard=Zkopírováno do schránky
save-success-text=Uložení úspěšné
delete-success-text=Smazání úspěšné
data-has-changed=Data byla změněna. Opravdu chcete zavřít stránku?
not-save-and-close=Neukládat, zavřít
cancel=Zrušit zavření
table-export-as=Exportovat tabulku Alt+E
export-as-sql-success-text=Export úspěšný. Otevřít soubor?
new-query=Nové okno dotazu (F7)
save-current=Uložit aktuální (Ctrl+S)
save-all=Uložit vše (Ctrl+Shift+S)
first-page=První strana
prev-page=Předchozí strana
next-page=Další strana
last-page=Poslední strana
save-if-data-has-changed=Data byla změněna. Uložit před zavřením?
unsort=Zpět řazení
tab-close-this=Zavřít tuto
tab-close-others=Zavřít ostatní
tab-close-left=Zavřít vše vlevo
tab-close-right=Zavřít vše vpravo
perf-analysis=Analýza výkonu
perf-analysis-reports=Zprávy z analýzy
store-analysis=Analýza úložiště
db-params=Parametry DB
not-select-sql=Podporovány jsou pouze SELECT příkazy
open-sql-log=Otevřít historii SQL pro analýzu výkonu (Ctrl+L)
add-sql-analysis=Zadejte SQL příkaz pro analýzu výkonu (Ctrl+I)
sql-log-not-found=Historie SQL nenalezena, zkontrolujte, zda nebyla smazána
original-sql=Původní SQL příkaz
where-clause-analysis=Analýza klauzule WHERE
order-clause-analysis=Analýza klauzule ORDER
covering-index-analysis=Analýza pokrývajících indexů
table-join-analysis=Analýza JOIN
in-table=Datová tabulka
where-use-column=Klauzule WHERE používá sloupce
order-use-column=Klauzule ORDER používá sloupce
covering-index-column=Klauzule WHERE a ORDER používají sloupce
where-use-index=Klauzule WHERE používá index
order-use-index=Klauzule ORDER používá index
use-covering-index=Používá pokrývající index
create-index-for-performance=Doporučení: vytvořte index pro následující sloupce pro zlepšení výkonu dotazů
hint-index-for-performance=Tip: index {hintIndexName} již pokrývá sloupce: {hintIndexColumns}
create-covering-index-for-performance=Doporučení: vytvořte pokrývající index pro následující sloupce pro zlepšení výkonu dotazů
create-index-togeger=Vytvořit index (společně)
create-index-individ=Vytvořit indexy (samostatně)
create-covering-index=Vytvořit pokrývající index
explain-query-plan=Vysvětlit plán dotazu
query-optimizer-pseudocode=Následující pseudokód ukazuje proces provádění optimalizátoru dotazů
cycle-count=Statistiky cyklů
optimize-cycle-count=Tip: změna pořadí spojení tabulek JOIN může optimalizovat a snížit počet cyklů.
general-settings=Obecná nastavení
about=O aplikaci
language-setting=Nastavení jazyka rozhraní
change-language-restart-text=Pro změnu jazyka je nutné aplikaci restartovat.
close-and-restart=Zavřít a restartovat
do-not-restart=Nerestartovat
about-us=O nás
about-us-description=CuteSqlite je open-source software vyvinutý autorem Xuehan Qin.
version-info=Verze
version-info-description=CuteSqlite v0.2.2 beta (64bitová)
feedback=Zpětná vazba
feedback-description=Pokud máte problémy se softwarem nebo máte nápady a návrhy pro tuto aplikaci, vyplňte prosím níže uvedený formulář a pošlete nám zpětnou vazbu.
content-text=Obsah
license=Apache License verze 2.0
select-columns-analysis=Analýza sloupců SELECT
select-use-column=Příkaz SELECT používá následující sloupce
select-use-column-count=Počet sloupců
select-use-column-advice=Doporučení: příkaz SELECT vybírá více než {maxColumns} sloupců. Snížení počtu sloupců může zlepšit výkon dotazů.
select-use-column-tips=Tip: snížení počtu sloupců může zlepšit výkon dotazů.
sql-perf-report-prefix=zpráva-výkonu-sql-
store-analysis-prefix=Analýza úložiště:
analysis-sql=Analýza SQL
open-perf-report=Otevřít zprávu Alt+O
drop-perf-report=Smazat zprávu Alt+Del
drop-perf-report-confirm-text=Potvrdit smazání zprávy?
store-analysis-text=Umožňuje analyzovat kapacitu úložiště databáze, tabulek a indexů
table-store-analysis=Tabulka - {tblName}
index-store-analysis=Index - {idxName} - Tabulka: {tblName}
db-disk-used-title=Zpráva o využití místa na disku, cesta k DB: {dbPath}
page-size-text=Velikost stránky (bajtů)
page-size-tips=Velikost stránky (bajtů)
file-bytes-text=Velikost souboru (bajtů)
file-bytes-tips=Velikost souboru (bajtů)
file-pgcnt-text=Počet stránek v celém souboru (změřený)
file-pgcnt-tips=Počet stránek v celém souboru (změřený)
file-pgcnt2-text=Počet stránek v celém souboru (vypočtený)
file-pgcnt2-tips=Počet stránek v celém souboru (vypočtený)
inuse-pgcnt-text=Počet stránek ukládajících data (používaných)
inuse-pgcnt-tips=Počet stránek ukládajících data (používaných)
free-pgcnt2-text=Počet stránek bez dat (podle hlavičky)
free-pgcnt2-tips=Počet stránek bez dat (podle hlavičky)
free-pgcnt-text=Počet stránek bez dat (vypočtený)
free-pgcnt-tips=Počet stránek bez dat (vypočtený)
av-pgcnt-text=Počet automaticky vyprázdněných stránek
av-pgcnt-tips=Počet automaticky vyprázdněných stránek
ntable-text=Počet tabulek v DB
ntable-tips=Počet tabulek v DB
nindex-text=Počet indexů
nindex-tips=Počet indexů
nmanindex-text=Počet definovaných indexů
nmanindex-tips=Počet definovaných indexů
nautoindex-text=Počet implicitních indexů (auto-increment)
nautoindex-tips=Počet implicitních indexů (auto-increment)
user-payload-text=Bajtů užitečného zatížení uživatele uložených
user-payload-tips=Bajtů užitečného zatížení uživatele uložených
all-tbl-entrycnt-title=Celkový počet záznamů ve všech tabulkách
all-tbl-idx-pagecnt-title=Počet stránek všech tabulek a jejich indexů
sperate-tbl-idx-pagecnt-title=Stránky všech tabulek a indexů počítané samostatně
all-tbl-idx-report-title=Všechny tabulky a indexy
total-pages-percent-text=Procento z celkového počtu stránek DB
total-pages-percent-tips=Procento z celkového počtu stránek DB
nentry-text=Množství dat (počet záznamů)
nentry-tips=Množství dat (počet záznamů)
storage-text=Využitý objem paměti (bajtů)
storage-tips=Využitý objem paměti (bajtů)
compressed-size-text=Využitý objem po kompresi (bajtů)
compressed-size-tips=Využitý objem po kompresi (bajtů)
payload-text=Objem užitečného zatížení (bajtů)
payload-tips=Objem užitečného zatížení (bajtů)
total-meta-text=Objem metadat (bajtů)
total-meta-tips=Objem metadat (bajtů)
depth-text=Hloubka B-stromu
depth-tips=Hloubka B-stromu
avg-payload-text=Průměrné užitečné zatížení na záznam
avg-payload-tips=Průměrné užitečné zatížení na záznam
avg-unused-text=Průměrný počet nevyužitých bajtů na záznam
avg-unused-tips=Průměrný počet nevyužitých bajtů na záznam
avg-meta-text=Průměrná metadata na záznam
avg-meta-tips=Průměrná metadata na záznam
avg-fanout-text=Průměrný faktor větvení
avg-fanout-tips=Průměrný faktor větvení
gap-cnt-text=Nesouvislé stránky
gap-cnt-tips=Nesouvislé stránky
mx-payload-text=Maximální užitečné zatížení na záznam
mx-payload-tips=Maximální užitečné zatížení na záznam
ovfl-cnt-text=Počet použitých přetečených záznamů
ovfl-cnt-tips=Počet použitých přetečených záznamů
int-pages-text=Počet použitých stránek indexů
int-pages-tips=Počet použitých stránek indexů
leaf-pages-text=Počet použitých listových stránek
leaf-pages-tips=Počet použitých listových stránek
ovfl-pages-text=Počet použitých stránek přetečení
ovfl-pages-tips=Počet použitých stránek přetečení
total-pages-text=Celkový počet použitých stránek
total-pages-tips=Celkový počet použitých stránek
int-unused-text=Nevyužité bajty na stránkách indexů
int-unused-tips=Nevyužité bajty na stránkách indexů
leaf-unused-text=Nevyužité bajty na listových stránkách
leaf-unused-tips=Nevyužité bajty na listových stránkách
ovfl-unused-text=Nevyužité bajty na stránkách přetečení
ovfl-unused-tips=Nevyužité bajty na stránkách přetečení
total-unused-text=Nevyužité bajty na všech stránkách
total-unused-tips=Nevyužité bajty na všech stránkách
all-table-report-title=Všechny tabulky (bez indexů)
all-indices-report-title=Všechny indexy (bez tabulek)
tbl-and-all-idx-report-title=Tabulka {tblName} a všechny její indexy
tbl-only-report-title=Tabulka {tblName} (bez indexů)
idx-only-report-title=Všechny indexy tabulky {tblName}
tbl-report-title=Tabulka {tblName}
idx-report-title=Index {idxName} tabulky {tblName}
props-tbl-only-report-title=Analýza úložiště tabulky {tblName}
props-idx-props-only-report-title=Všechny indexy tabulky {tblName}
db-pragma-params=Parametry PRAGMA
db-quick-config-params=Rychlá nastavení
select-pragma=PRAGMA
pragma-analysis-limit-tips=Dotaz nebo změna omezení pro nastavení analýzy (ANALYZE). Toto je přibližný počet řádků, který příkaz ANALYZE kontroluje v každém indexu.
pragma-application-id-tips=Používá se pro dotaz nebo nastavení 32bitového celého čísla se znaménkem "Application ID" v pořadí big-endian umístěného na offsetu 68 v hlavičce databáze.
pragma-auto-vacuum-tips=Dotaz nebo nastavení stavu automatického vyprazdňování (auto-vacuum) v databázi.
pragma-automatic-index-tips=Dotaz, zapnutí nebo vypnutí funkce automatického indexování.
pragma-busy-timeout-tips=Dotaz nebo změna nastavení časového limitu při zaneprázdnění (busy timeout).
pragma-cache-size-tips=Dotaz nebo změna maximálního počtu stránek databáze na disku, které SQLite doporučuje uchovávat v paměti pro každý otevřený soubor databáze.
pragma-cache-spill-tips=Zapnutí nebo vypnutí schopnosti stránkovacího programu zapsat "špinavé" stránky mezipaměti do databázového souboru uprostřed transakce.
pragma-case-sensitive-like-tips=Výchozí chování operátoru LIKE ignoruje velikost písmen u ASCII znaků. Proto je ve výchozím nastavení 'a' LIKE 'A' pravdivé.
pragma-cell-size-check-tips=Zapnutí nebo vypnutí dodatečných kontrol integrity při čtení stránek B-stromu databáze z disku. Pokud je kontrola velikosti buňky zapnuta, poškození databáze může být odhaleno dříve a je méně pravděpodobné, že se "rozšíří".
pragma-checkpoint-fullfsync-tips=Dotaz nebo změna příznaku fullfsync pro operace kontrolních bodů (checkpoint). Pokud je tento příznak nastaven, bude při operacích kontrolních bodů v systémech podporujících F_FULLFSYNC použita metoda synchronizace F_FULLFSYNC. Výchozí hodnota příznaku CHECKPOINT_FULLFSYNC je OFF. Pouze Mac OS-X podporuje F_FULLFSYNC.
pragma-collation-list-tips=Vrací seznam porovnávacích sekvencí (collation) definovaných pro aktuální připojení k databázi.
pragma-compile-options-tips=Vrací názvy voleb použitých při kompilaci SQLite, jednu volbu na řádek.
pragma-count-changes-tips=Dotaz nebo změna příznaku počítání změn (count changes). Obvykle, když není příznak count-changes nastaven, příkazy INSERT, UPDATE a DELETE nevracejí data.
pragma-data-store-directory-tips=Dotaz nebo změna hodnoty globální proměnné sqlite3_data_directory, kterou používá backend rozhraní Windows pro určení umístění souborů databáze zadaných relativní cestou.
pragma-data-version-tips=Indikuje, že databázový soubor byl změněn. Interaktivní programy, které uchovávají obsah databáze v paměti nebo jej zobrazují na obrazovce, mohou použít příkaz PRAGMA data_version k určení, zda potřebují obnovit a znovu načíst paměť nebo aktualizovat zobrazení na obrazovce.
pragma-default-cache-size-tips=Dotaz nebo nastavení doporučeného maximálního počtu stránek diskové mezipaměti, které budou přiděleny pro každý otevřený soubor databáze.
pragma-defer-foreign-keys-tips=Nařizuje odložit všechna omezení cizího klíče až do potvrzení nejvzdálenější transakce.
pragma-empty-result-callbacks-tips=Dotaz nebo změna příznaku zpětného volání pro prázdný výsledek.
pragma-encoding-tips=Textové kódování používané hlavní databází: 'UTF-8', 'UTF-16le' (little-endian UTF-16) nebo 'UTF-16be' (big-endian UTF-16).
pragma-foreign-key-check-tips=Kontroluje databázi nebo tabulku na porušení omezení cizího klíče.
pragma-foreign-keys-tips=Dotaz, zapnutí nebo vypnutí vynucování omezení cizího klíče.
pragma-freelist-count-tips=Vrací počet nepoužívaných stránek v databázovém souboru.
pragma-full-column-names-tips=Dotaz nebo změna příznaku full_column_names.
pragma-fullfsync-tips=Dotaz nebo změna příznaku fullfsync. Tento příznak určuje, zda bude použita metoda synchronizace F_FULLFSYNC v systémech, které ji podporují. Výchozí hodnota fullfsync je OFF. Pouze Mac OS X podporuje F_FULLFSYNC.
pragma-hard-heap-limit-tips=Nastavuje limit na množství haldy (heap) pro všechna připojení k databázi v jednom procesu.
pragma-ignore-check-constraints-tips=Zapnutí nebo vypnutí vynucování omezení CHECK. Výchozí nastavení je OFF, což znamená, že omezení CHECK jsou ve výchozím nastavení vynucována.
pragma-incremental-vacuum-tips=Způsobí odstranění až N stránek ze seznamu volných stránek (freelist).
pragma-integrity-check-tips=Provádí nízkoúrovňovou kontrolu formátování a konzistence databáze.
pragma-journal-mode-tips=Dotaz nebo nastavení režimu deníku (journal mode) pro databázi přidruženou k aktuálnímu připojení.
pragma-journal-size-limit-tips=Omezuje velikost souborů zpětného deníku (rollback journal) a WAL, které zůstávají v souborovém systému po transakci nebo kontrolním bodu.
pragma-legacy-alter-table-tips=Nastavuje nebo dotazuje hodnotu příznaku legacy_alter_table.
pragma-locking-mode-tips=Nastavuje nebo dotazuje režim zamykání (locking mode) připojení k databázi. Režimy jsou NORMAL nebo EXCLUSIVE.
pragma-max-page-count-tips=Dotaz nebo nastavení maximálního počtu stránek v databázovém souboru.
pragma-mmap-size-tips=Dotaz nebo změna maximálního počtu bajtů vyhrazených pro I/O mapované do paměti (memory-mapped I/O) pro jednu databázi.
pragma-module-list-tips=Vrací seznam modulů virtuálních tabulek registrovaných u připojení k databázi.
pragma-optimize-tips=Pokouší se optimalizovat databázi.
pragma-page-count-tips=Vrací celkový počet stránek v databázovém souboru.
pragma-page-size-tips=Dotaz nebo nastavení velikosti stránky databáze. Velikost stránky musí být mocninou dvou mezi 512 a 65536.
pragma-parser-trace-tips=Zapíná trasování syntaktického analyzátoru SQL používaného interně SQLite. Funguje pouze při kompilaci s SQLITE_DEBUG.
pragma-query-only-tips=Zabraňuje změnám dat v databázovém souboru. Pokud je tato volba zapnuta, jakýkoli pokus o CREATE, UPDATE, DROP, INSERT nebo UPDATE povede k chybě SQLITE_READONLY.
pragma-quick-check-tips=Provádí nízkoúrovňovou kontrolu formátování a konzistence databáze, přičemž přeskočí kontroly konzistence UNIQUE a indexů.
pragma-read-uncommitted-tips=Dotaz, zapnutí nebo vypnutí úrovně izolace READ UNCOMMITTED.
pragma-recursive-triggers-tips=Dotaz, zapnutí nebo vypnutí rekurzivního provádění triggerů.
pragma-reverse-unordered-selects-tips=Pokud je tato pragma zapnuta, mnoho SELECT dotazů bez ORDER BY bude vracet výsledky v obráceném pořadí, než je obvyklé.
pragma-schema-version-tips=Získá nebo nastaví celé číslo schema_version na offsetu 40 v hlavičce databáze.
pragma-secure-delete-tips=Dotaz nebo změna nastavení bezpečného mazání (secure-delete).
pragma-short-column-names-tips=Dotaz nebo změna příznaku krátkých názvů sloupců.
pragma-soft-heap-limit-tips=Omezuje množství haldy používané všemi připojeními k databázi v jednom procesu.
pragma-stats-tips=Vrací pomocné informace o tabulkách a indexech.
pragma-synchronous-tips=Dotaz nebo změna nastavení příznaku "synchronous".
pragma-temp-store-tips=Dotaz nebo změna hodnoty globální proměnné sqlite3_temp_directory, kterou používá mnoho backendů rozhraní OS k určení umístění pro ukládání dočasných tabulek a indexů.
pragma-threads-tips=Počet pomocných vláken spouštěných připraveným příkazem (prepared statement) pro pomoc při provádění dotazu.
pragma-trusted-schema-tips=Určuje, zda je povoleno spouštění nebezpečných SQL funkcí a virtuálních tabulek ve schématu. Určuje, zda pohledy, triggery nebo výrazy schématu (např. omezení CHECK, klauzule DEFAULT, generované sloupce, indexy na výrazech a/nebo částečné indexy) mohou spouštět nebezpečné SQL funkce a virtuální tabulky.
pragma-user-version-tips=Získá nebo nastaví celé číslo user_version na offsetu 60 v hlavičce databáze.
pragma-vdbe-addoptrace-tips=Úplné operační kódy VDBE se zobrazí během generování kódu. Funguje, pokud je SQLite zkompilováno s volbou SQLITE_DEBUG a je zapnutý vdbe_debug.
pragma-vdbe-debug-tips=Zapíná ladění VDBE. Funguje, pokud je SQLite zkompilováno s volbou SQLITE_DEBUG.
pragma-vdbe-listing-tips=Vypíše úplný seznam operačních kódů virtuálního stroje na standardní výstup. Funguje, pokud je SQLite zkompilováno s volbou SQLITE_DEBUG a je zapnutý vdbe_debug.
pragma-vdbe-trace-tips=Vypisuje operační kódy virtuálního stroje na standardní výstup během výpočtu. Funguje, pokud je SQLite zkompilováno s volbou SQLITE_DEBUG a je zapnutý vdbe_debug.
pragma-wal-autocheckpoint-tips=Dotaz nebo nastavení intervalu automatického kontrolního bodu (auto-checkpoint) pro deník zápisu předem (write-ahead log).
pragma-wal-checkpoint-tips=Způsobí přenos obsahu deníku zápisu předem (write-ahead log) pro databázi X v připojení D do databázového souboru a resetování deníku zápisu předem.
pragma-writable-schema-tips=Umožňuje měnit tabulku sqlite_schema pomocí běžných příkazů UPDATE, INSERT a DELETE. Varování: zneužití této pragmy může snadno vést k poškození databázového souboru.
pragma-save-confirm=Příkaz PRAGMA ovlivní činnost databáze. Potvrdit provedení následujícího příkazu?
confirm-exec-text=Potvrdit a provést